; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image2 - mode
	infrared0 - mode
	spectrograph1 - mode
	Star7 - direction
	Star0 - direction
	Star5 - direction
	Star6 - direction
	GroundStation4 - direction
	Star3 - direction
	Star8 - direction
	Star2 - direction
	GroundStation1 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image2)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star6)
	(supports instrument1 infrared0)
	(supports instrument1 image2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument3 image2)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 Star5)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph1)
	(supports instrument4 image2)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument5 image2)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 Star6)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument6 image2)
	(supports instrument6 spectrograph1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star8)
	(calibration_target instrument6 Star3)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 infrared0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star2)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
)
(:goal (and
	(pointing satellite3 Star6)
	(have_image Phenomenon9 spectrograph1)
	(have_image Phenomenon10 infrared0)
	(have_image Phenomenon11 infrared0)
	(have_image Star12 infrared0)
	(have_image Star13 spectrograph1)
	(have_image Phenomenon14 infrared0)
	(have_image Planet15 spectrograph1)
))

)

; plan
1. (turn_to satellite0 star0 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star0)
   goals met: 0 of 8
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite0 phenomenon9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 8
5. (take_image satellite0 phenomenon9 instrument1 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 1 of 8
6. (turn_to satellite0 phenomenon14 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 8
7. (take_image satellite0 phenomenon14 instrument1 infrared0)
   added: (have_image phenomenon14 infrared0)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon11 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon11 instrument1 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 3 of 8
10. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 8
11. (take_image satellite0 phenomenon10 instrument1 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 4 of 8
12. (turn_to satellite0 planet15 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet15)
   goals met: 4 of 8
13. (take_image satellite0 planet15 instrument1 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 5 of 8
14. (turn_to satellite0 star12 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star12)
   goals met: 5 of 8
15. (take_image satellite0 star12 instrument1 infrared0)
   added: (have_image star12 infrared0)
   goals met: 6 of 8
16. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 6 of 8
17. (take_image satellite0 star13 instrument1 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 7 of 8
18. (turn_to satellite3 star6 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 star6)
   goals met: 8 of 8
